# Gözlem ve Değişken Seçimi  : loc ve iloc

In [1]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size= (10,3))
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df

   var1  var2  var3
0    27    19     6
1    27     2     3
2     9    29    13
3     7     7    21
4    17    10    12
5    13    20    27
6    19    26    24
7    27    13    18
8     5    14    16
9     1    26    20

## loc : tanımlandığı şekliyle seçim yapmak için kullanılır

In [2]:
df.loc[0:3]

   var1  var2  var3
0    27    19     6
1    27     2     3
2     9    29    13
3     7     7    21

## iloc : alışık olduğumuz index mantığıyla seçim yapar

In [3]:
df.iloc[0:3]

   var1  var2  var3
0    27    19     6
1    27     2     3
2     9    29    13

In [4]:
df.iloc[0,0]

27

In [5]:
df.iloc[:3, :2]

   var1  var2
0    27    19
1    27     2
2     9    29

In [6]:
df

   var1  var2  var3
0    27    19     6
1    27     2     3
2     9    29    13
3     7     7    21
4    17    10    12
5    13    20    27
6    19    26    24
7    27    13    18
8     5    14    16
9     1    26    20

In [7]:
df.loc[0:3 , "var3"] #belirlenen kurallara göre

0     6
1     3
2    13
3    21
Name: var3, dtype: int32

In [8]:
df.iloc[0:3]["var3"] #klasik index mantığı

0     6
1     3
2    13
Name: var3, dtype: int32

# Koşullu Eleman İşlemleri

In [9]:
df

   var1  var2  var3
0    27    19     6
1    27     2     3
2     9    29    13
3     7     7    21
4    17    10    12
5    13    20    27
6    19    26    24
7    27    13    18
8     5    14    16
9     1    26    20

In [10]:
df["var1"][0:2]

0    27
1    27
Name: var1, dtype: int32

In [11]:
df[0:2][["var1","var2"]]

   var1  var2
0    27    19
1    27     2

In [12]:
df

   var1  var2  var3
0    27    19     6
1    27     2     3
2     9    29    13
3     7     7    21
4    17    10    12
5    13    20    27
6    19    26    24
7    27    13    18
8     5    14    16
9     1    26    20

In [13]:
df.var1

0    27
1    27
2     9
3     7
4    17
5    13
6    19
7    27
8     5
9     1
Name: var1, dtype: int32

In [14]:
df[df.var1 > 15] #var 1 adlı değişkenler içinde 15 büyük olanlar için filtreleme

   var1  var2  var3
0    27    19     6
1    27     2     3
4    17    10    12
6    19    26    24
7    27    13    18

In [15]:
df[df.var1 > 15]["var2"]

0    19
1     2
4    10
6    26
7    13
Name: var2, dtype: int32

In [16]:
df[(df.var1 > 15) & (df.var3 < 25)]

   var1  var2  var3
0    27    19     6
1    27     2     3
4    17    10    12
6    19    26    24
7    27    13    18

In [17]:
df.loc[(df.var1 > 15) , ["var1", "var2"]]

   var1  var2
0    27    19
1    27     2
4    17    10
6    19    26
7    27    13

In [18]:
df[(df.var1 > 15)] ["var1"]

0    27
1    27
4    17
6    19
7    27
Name: var1, dtype: int32

In [19]:
df[(df.var1 > 15)] [["var1", "var2"]]

   var1  var2
0    27    19
1    27     2
4    17    10
6    19    26
7    27    13

## Birleştirme  JOIN  İşlemleri

In [20]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size= (5,3))
df1 = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df1

   var1  var2  var3
0    22    11    20
1    17     1    23
2    24    19    20
3     2    24     5
4    28    16    13

In [21]:
df2 =  df1 + 99

In [22]:
df2

   var1  var2  var3
0   121   110   119
1   116   100   122
2   123   118   119
3   101   123   104
4   127   115   112

In [23]:
pd.concat([df1, df2]) #indexlerde sorun gözlemleniyor

   var1  var2  var3
0    22    11    20
1    17     1    23
2    24    19    20
3     2    24     5
4    28    16    13
0   121   110   119
1   116   100   122
2   123   118   119
3   101   123   104
4   127   115   112

In [24]:
?pd.concat

Signature:
pd.concat(
    objs: 'Iterable[NDFrame] | Mapping[HashableT, NDFrame]',
    *,
    axis: 'Axis' = 0,
    join: 'str' = 'outer',
    ignore_index: 'bool' = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: 'bool' = False,
    sort: 'bool' = False,
    copy: 'bool | None' = None,
) -> 'DataFrame | Series'
Docstring:
Concatenate pandas objects along a particular axis.

Allows optional set logic along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

It is not recommended to build DataFrames by adding single rows in a
for loop. Build a list of rows and make a DataFrame in a single concat.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']

Append a single row to the end of a ``DataFrame`` object.

>>> df7 = pd.DataFrame({'a': 1, 'b': 2}, index=[0])
>>> df7
    a   b
0   1   2
>>> new_row = pd.Series({'a': 3, 'b': 4})
>>> new_row
a    3
b    4
dtype: int64
>>> pd.concat([df7, new_row.to_frame().T], ignore_index=True)
    a   b
0   1   2
1   3   4
File:      c:\users\90530\anaconda3\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [25]:
pd.concat([df1, df2], ignore_index = True) #index problemi ortadan kalktı

   var1  var2  var3
0    22    11    20
1    17     1    23
2    24    19    20
3     2    24     5
4    28    16    13
5   121   110   119
6   116   100   122
7   123   118   119
8   101   123   104
9   127   115   112

In [27]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [28]:
df2.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [29]:
df2.columns = ['var1', 'var2', 'deg3']

In [30]:
df2

   var1  var2  deg3
0   121   110   119
1   116   100   122
2   123   118   119
3   101   123   104
4   127   115   112

In [32]:
df1

   var1  var2  var3
0    22    11    20
1    17     1    23
2    24    19    20
3     2    24     5
4    28    16    13

In [33]:
pd.concat([df1, df2])

   var1  var2  var3   deg3
0    22    11  20.0    NaN
1    17     1  23.0    NaN
2    24    19  20.0    NaN
3     2    24   5.0    NaN
4    28    16  13.0    NaN
0   121   110   NaN  119.0
1   116   100   NaN  122.0
2   123   118   NaN  119.0
3   101   123   NaN  104.0
4   127   115   NaN  112.0

In [34]:
pd.concat([df1, df2], join ="inner")

   var1  var2
0    22    11
1    17     1
2    24    19
3     2    24
4    28    16
0   121   110
1   116   100
2   123   118
3   101   123
4   127   115

In [40]:
pd.concat([df1, df2], join_axes = [df2.columns]) #join axes argumanı concat için kalkmış

TypeError: concat() got an unexpected keyword argument 'join_axes'

## İleri birleştirme işlemleri

In [41]:
import pandas as pd

### birebir birleştirtme

In [43]:
df1 = pd.DataFrame({"employees" : ["Ali", "Veli", "Ayşe", "Fatma"],
                    "group" : ["Accounting", "Engineering", "Engineering", "HR"]})
df1

  employees        group
0       Ali   Accounting
1      Veli  Engineering
2      Ayşe  Engineering
3     Fatma           HR

In [44]:
df2 = pd.DataFrame({"employees": ["Ayşe", "Ali", "Veli", "Fatma"],
                    "jobentry" : [2010, 2009, 2014, 2019]})
df2

  employees  jobentry
0      Ayşe      2010
1       Ali      2009
2      Veli      2014
3     Fatma      2019

In [45]:
pd.merge(df1,df2)

  employees        group  jobentry
0       Ali   Accounting      2009
1      Veli  Engineering      2014
2      Ayşe  Engineering      2010
3     Fatma           HR      2019

In [46]:
pd.merge(df1,df2, on = "employees")

  employees        group  jobentry
0       Ali   Accounting      2009
1      Veli  Engineering      2014
2      Ayşe  Engineering      2010
3     Fatma           HR      2019

## many to one

In [47]:
df3 = pd.merge(df1, df2)

In [48]:
df3

  employees        group  jobentry
0       Ali   Accounting      2009
1      Veli  Engineering      2014
2      Ayşe  Engineering      2010
3     Fatma           HR      2019

In [49]:
df4 = pd.DataFrame({"group" : ["Accounting", "Engineering", "HR"],
                   "manager" : ["Caner", "Mustafa", "Berkcan"]})
df4

         group  manager
0   Accounting    Caner
1  Engineering  Mustafa
2           HR  Berkcan

In [50]:
pd.merge(df3, df4)

  employees        group  jobentry  manager
0       Ali   Accounting      2009    Caner
1      Veli  Engineering      2014  Mustafa
2      Ayşe  Engineering      2010  Mustafa
3     Fatma           HR      2019  Berkcan

## many to many

In [51]:
df5 = pd.DataFrame({"group" : ["Accounting", "Accounting","Engineering", "Engineering", "HR", "HR"],
                   "skills" : ["math", "excel", "coding", "linux", "excel","management"]})
df5

         group      skills
0   Accounting        math
1   Accounting       excel
2  Engineering      coding
3  Engineering       linux
4           HR       excel
5           HR  management

In [52]:
pd.merge(df1, df5)

  employees        group      skills
0       Ali   Accounting        math
1       Ali   Accounting       excel
2      Veli  Engineering      coding
3      Veli  Engineering       linux
4      Ayşe  Engineering      coding
5      Ayşe  Engineering       linux
6     Fatma           HR       excel
7     Fatma           HR  management